diary/201607/16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
  <title>github提交代码到github仓库</title>
  <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
  <meta name="title" content="github提交代码到github仓库" />
  <meta name="generator" content="Org-mode" />
  <meta name="generated" content="2016-07-22T20:14+0800" />
  <meta name="author" content="ALIANG" />
  <meta name="description" content="" />
  <meta name="keywords" content="DIARY" />

</head>

<body>

  <div id="preamble">

  </div>

  <div id="content">
    <h1 class="title">github提交代码到github仓库</h1>

    <p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
    </p>
    <p>
      -日期：2016-07-12；作者：阿亮；关键字：笔记、github
    </p>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li><a href="#sec-1">1 github提交代码到github仓库</a>
            <ul>
              <li><a href="#sec-1-1">1.1 正常使用Push提交</a></li>
              <li><a href="#sec-1-2">1.2 push方法1：</a></li>
              <li><a href="#sec-1-3">1.3 push方法2：</a></li>
              <li><a href="#sec-1-4">1.4 push方法3</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> github提交代码到github仓库</h2>
      <div class="outline-text-2" id="text-1">


      </div>

      <div id="outline-container-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> 正常使用Push提交</h3>
        <div class="outline-text-3" id="text-1-1">

          <p>git remote add origin <a href="https://github.com/XXX(username)">https://github.com/XXX(username)</a>/YYYY(projectname).git
          </p>
          <p>
            加上一个remote的地址，名叫origin，地址是github上的地址（Create a new repo就会有）
          </p>
          <p>
            因为Git是分布式的，所以可以有多个remote.
          </p>


          <pre class="src src-git">git push -u origin master
          </pre>

          <p>
            将本地内容push到github上的那个地址上去。
          </p>
          <p>
            参数-u
          </p>
          <p>
            用了参数-u之后，以后就可以直接用不带参数的git pull从之前push到的分支来pull。此时如果origin的master分支上有一些本地没有的提,push会失败.所以解决的办法是, 首先设定本地master的上游分支:
          </p>


          <pre class="src src-git">git branch --set-upstream-to=origin/master
          </pre>

          <p>
            然后pull:
          </p>


          <pre class="src src-git">git pull --rebase
          </pre>

          <p>
            最后再push:
          </p>


          <pre class="src src-git">git push
          </pre>

        </div>

      </div>

      <div id="outline-container-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> push方法1：</h3>
        <div class="outline-text-3" id="text-1-2">

          <p>现在如果想直接Push这个develop分支上的内容到github
          </p>


          <pre class="src src-git">git push -u origin
          </pre>

          <p>
            如果是新建分支第一次push，会提示：
          </p>


          <pre class="src src-git">fatal: The current branch develop has no upstream branch. To push the current branch and set the remote as upstream,
            use git push --set-upstream origin develop
          </pre>

          <p>
            输入这行命令，然后输入用户名和密码，就push成功了。 以后的push就只需要输入
          </p>


          <pre class="src src-git">git push origin
          </pre>

        </div>

      </div>

      <div id="outline-container-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> push方法2：</h3>
        <div class="outline-text-3" id="text-1-3">

          <p>比如新建了一个叫dev的分支，而github网站上还没有，可以直接：
          </p>


          <pre class="src src-git">git push -u origin dev
          </pre>

          <p>
            这样一个新分支就创建好了。
          </p>
        </div>

      </div>

      <div id="outline-container-1-4" class="outline-3">
        <h3 id="sec-1-4"><span class="section-number-3">1.4</span> push方法3</h3>
        <div class="outline-text-3" id="text-1-4">

          <p>提交到github的分支有多个，提交时可以用这样的格式：
          </p>


          <pre class="src src-git">git push -u origin local:remote &#27604;&#22914;&#65306;git push -u origin master:master
          </pre>

          <p>
            表明将本地的master分支（冒号前）push到github的master分支（冒号后）。
          </p>
          <p>
            如果左边不写为空，将会删除远程的右边分支。
          </p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble">
    <p class="date">Date: 2016-07-22T20:14+0800</p>
    <p class="author">Author: ALIANG</p>
    <p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version
      24</p>
    <a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

  </div>
</body>

</html>